Tekla Open API Reference for Tekla Structures 2025
Events.DrawingLoaded Event
 The DrawingLoaded event is raised when a new drawing is opened in the drawing editor.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.DrawingLoadedDelegate DrawingLoaded
Public Event DrawingLoaded As Events.DrawingLoadedDelegate
Value
Type: Tekla.Structures.Drawing.UI.Events.DrawingLoadedDelegate
Implements
IUIEvents.DrawingLoaded
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace